import pytest

from metro.main import init_app


@pytest.fixture
async def client(aiohttp_client):
    app = await init_app()
    return await aiohttp_client(app)

@pytest.fixture
async def hh_stations():
    return [
            "Кунцевская",
            "Римская",
            "Стрешнево",
            "Раменки",
            "Китай-город",
            "Ясенево",
            "Сретенский бульвар",
            "Студенческая",
            "Измайловская",
            "Зябликово",
            "Локомотив",
            "Братиславская",
            "Коптево",
            "Лужники",
            "Октябрьская",
            "Селигерская",
            "Крымская",
            "Телецентр",
            "Улица академика янгеля",
            "Люблино",
            "Площадь революции",
            "Чеховская",
            "Шоссе энтузиастов",
            "Проспект вернадского",
            "Бунинская аллея",
            "Новые черемушки",
            "Кантемировская",
            "Измайлово",
        ]

@pytest.fixture
async def req_stations(hh_stations):
    return [
            "Кунцевская",
            "Римская",
            "Стрешнево",
            "Раменки",
            "Китай-город",
            "Ясенево",
            "Выхино",
            "Новогиреево",
        ]
